using Microsoft.VisualBasic.ApplicationServices;

namespace tetris
{
    public partial class Form1 : Form
    {
        public int minoRow, minoCol, randomMino;
        public int[,] firstBoard = new int[22, 12]
            {
                { 8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8 },
                { 8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8 },
                { 8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8 },
                { 8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8 },
                { 8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8 },
                { 8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8 },
                { 8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8 },
                { 8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8 },
                { 8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8 },
                { 8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8 },
                { 8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8 },
                { 8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8 },
                { 8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8 },
                { 8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8 },
                { 8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8 },
                { 8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8 },
                { 8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8 },
                { 8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8 },
                { 8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8 },
                { 8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8 },
                { 8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8 },
                { 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8 }
            };
        public int[,] board = new int[22, 12];


        public int[,,,] mino = new int[8, 4, 4, 4]
        {
            { //なにもない
                { //上
                    {0,0,0,0},
                    {0,0,0,0},
                    {0,0,0,0},
                    {0,0,0,0}
                },
                { //右
                    {0,0,0,0},
                    {0,0,0,0},
                    {0,0,0,0},
                    {0,0,0,0}
                },
                { //下
                    {0,0,0,0},
                    {0,0,0,0},
                    {0,0,0,0},
                    {0,0,0,0}
                },
                { //左
                    {0,0,0,0},
                    {0,0,0,0},
                    {0,0,0,0},
                    {0,0,0,0}
                },
            },
            { //Iミノ
                { //上
                    {0,0,0,0},
                    {1,1,1,1},
                    {0,0,0,0},
                    {0,0,0,0}
                },
                { //右
                    {0,0,1,0},
                    {0,0,1,0},
                    {0,0,1,0},
                    {0,0,1,0}
                },
                { //下
                    {0,0,0,0},
                    {0,0,0,0},
                    {1,1,1,1},
                    {0,0,0,0}
                },
                { //左
                    {0,1,0,0},
                    {0,1,0,0},
                    {0,1,0,0},
                    {0,1,0,0}
                },
            },
            { //Oミノ
                { //上
                    {0,0,0,0},
                    {2,2,0,0},
                    {2,2,0,0},
                    {0,0,0,0}
                },
                { //右
                    {0,0,0,0},
                    {2,2,0,0},
                    {2,2,0,0},
                    {0,0,0,0}
                },
                { //下
                    {0,0,0,0},
                    {2,2,0,0},
                    {2,2,0,0},
                    {0,0,0,0}
                },
                { //左
                    {0,0,0,0},
                    {2,2,0,0},
                    {2,2,0,0},
                    {0,0,0,0}
                }
            },
            { //Sミノ
                { //上
                    {0,0,0,0},
                    {0,3,3,0},
                    {3,3,0,0},
                    {0,0,0,0}
                },
                { //右
                    {0,0,0,0},
                    {0,3,0,0},
                    {0,3,3,0},
                    {0,0,3,0}
                },
                { //下
                    {0,0,0,0},
                    {0,0,0,0},
                    {0,3,3,0},
                    {3,3,0,0}
                },
                { //左
                    {0,0,0,0},
                    {3,0,0,0},
                    {3,3,0,0},
                    {0,3,0,0}
                },
            },
            { //Zミノ
                { //上
                    {0,0,0,0},
                    {4,4,0,0},
                    {0,4,4,0},
                    {0,0,0,0}
                },
                { //右
                    {0,0,0,0},
                    {0,0,4,0},
                    {0,4,4,0},
                    {0,4,0,0}
                },
                { //下
                    {0,0,0,0},
                    {0,0,0,0},
                    {4,4,0,0},
                    {0,4,4,0}
                },
                { //左
                    {0,0,0,0},
                    {0,4,0,0},
                    {4,4,0,0},
                    {4,0,0,0}
                },
            },
            { //Jミノ
                { //上
                    {0,0,0,0},
                    {5,0,0,0},
                    {5,5,5,0},
                    {0,0,0,0}
                },
                { //右
                    {0,0,0,0},
                    {0,5,5,0},
                    {0,5,0,0},
                    {0,5,0,0}
                },
                { //下
                    {0,0,0,0},
                    {0,0,0,0},
                    {5,5,5,0},
                    {0,0,5,0}
                },
                { //左
                    {0,0,0,0},
                    {0,0,5,0},
                    {0,0,5,0},
                    {5,5,5,0}
                },
            },
            { //Lミノ
                { //上
                    {0,0,0,0},
                    {0,0,6,0},
                    {6,6,6,0},
                    {0,0,0,0}
                },
                { //右
                    {0,0,0,0},
                    {0,6,0,0},
                    {0,6,0,0},
                    {0,6,6,0}
                },
                { //下
                    {0,0,0,0},
                    {0,0,0,0},
                    {6,6,6,0},
                    {6,0,0,0}
                },
                { //左
                    {0,0,0,0},
                    {6,6,0,0},
                    {0,6,0,0},
                    {0,6,0,0}
                },
            },
            { //Tミノ
                { //上
                    {0,0,0,0},
                    {0,7,0,0},
                    {7,7,7,0},
                    {0,0,0,0}
                },
                { //右
                    {0,0,0,0},
                    {0,7,0,0},
                    {0,7,7,0},
                    {0,7,0,0}
                },
                { //下
                    {0,0,0,0},
                    {0,0,0,0},
                    {7,7,7,0},
                    {0,7,0,0}
                },
                { //左
                    {0,0,0,0},
                    {0,7,0,0},
                    {7,7,0,0},
                    {0,7,0,0}
                },
            },
        };

        public enum minoColor
        {
            none = 0,
            i = 1,
            o = 2,
            s = 3,
            z = 4,
            j = 5,
            l = 6,
            t = 7,
            boarder = 8
        }

        public Dictionary<minoColor, Color> minoBackColor = new Dictionary<minoColor, Color>()
        {
            {minoColor.none, Color.DarkGray},
            {minoColor.i, Color.Cyan},
            {minoColor.o, Color.Yellow},
            {minoColor.s, Color.Green},
            {minoColor.z, Color.Red},
            {minoColor.j, Color.Blue},
            {minoColor.l, Color.Orange},
            {minoColor.t, Color.Purple},
            {minoColor.boarder, Color.Black}
        };

        public Form1()
        {
            InitializeComponent();
            //ランダムにミノの種類を選択
            Random random = new Random();
            randomMino = random.Next(1, 8);

            //初期のミノの位置
            minoRow = 0;
            minoCol = 4;
            timer.Start();
        }

        private void timerTick(object sender, EventArgs e)
        {
            //ミノの位置を時間で変化
            board = firstBoard;
            for (int i = 0; i < mino.GetLength(2); i++)
            {
                for (int j = 0; j < mino.GetLength(3); j++)
                {
                    board[i + minoRow, j + minoCol] = mino[randomMino, 0, i, j];
                }
            }

            if (board.GetLength(0) - minoRow > 5) minoRow++;

            Drow(board);

        }

        public void Drow(int[,] n)
        {
            Control[] c;
            PictureBox pic;
            string boxName;
            for (int i = 1; i < board.GetLength(0); i++)
            {
                for (int j = 1; j < board.GetLength(1); j++)
                {
                    boxName = Convert.ToString(i * board.GetLength(1) + j);
                    c = this.Controls.Find("pictureBox" + boxName, true);
                    pic = (PictureBox)c[0];
                    pic.BackColor = minoBackColor[(minoColor)n[i, j]];
                }
            }
        }
    }
}